In [5]:
'''
INTRODUCTION TO PANDAS üêº
Python library for data analysis and manipulation

Two main data structures
1D - Series (list)
2D - DataFrame (matrix)

Why ?
- Support for CSV, Excel, SQL, JSON etc
- Powerful data aggregation and grouping
- Easy handling of missing
- Convenient for filtering, joining, and reshaping
'''

'\nINTRODUCTION TO PANDAS üêº\nPython library for data analysis and manipulation\n\nTwo main data structures\n1D - Series (list)\n2D - DataFrame (matrix)\n\nWhy ?\n- Support for CSV, Excel, SQL, JSON etc\n- Powerful data aggregation and grouping\n- Easy handling of missing\n- Convenient for filtering, joining, and reshaping\n'

In [6]:
import numpy as np
import pandas as pd

In [18]:
friends = {
    "name": ["Nitin", "Shyam", "Pavan"],
    "city": ["Bangalore", "Delhi", "Vishakha"],
    "marks": [98, 99, 100]
}

In [19]:
# Create dataframe
df = pd.DataFrame(friends)

In [20]:
df

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99
2  Pavan   Vishakha    100

In [21]:
# Saving dataframe to files
df.to_csv('friends.csv')

In [22]:
# Saving dataframe to files without index
df.to_csv('friends.csv', index=False)

In [23]:
# top of dataframe
df.head(2)

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99

In [24]:
# bottom of dataframe
df.tail(2)

    name      city  marks
1  Shyam     Delhi     99
2  Pavan  Vishakha    100

In [25]:
df

    name       city  marks
0  Nitin  Bangalore     98
1  Shyam      Delhi     99
2  Pavan   Vishakha    100

In [27]:
df.describe()

       marks
count    3.0
mean    99.0
std      1.0
min     98.0
25%     98.5
50%     99.0
75%     99.5
max    100.0

In [28]:
friendsRead = pd.read_csv('friends-read.csv')

In [29]:
friendsRead

     name       city  marks
0   Nitin  Bangalore     98
1   Shyam      Delhi     99
2   Pavan   Vishakha    100
3  Anjali     Mumbai     95
4    Ravi    Chennai     88
5   Meena  Hyderabad     92
6    Aman       Pune     85
7   Sneha    Kolkata     93
8     Raj  Ahmedabad     90
9   Divya     Jaipur     97

In [30]:
friendsRead.describe()

           marks
count   10.00000
mean    93.70000
std      4.98999
min     85.00000
25%     90.50000
50%     94.00000
75%     97.75000
max    100.00000

In [34]:
# matrix - [row][column]
# df - [col][row]
friendsRead['name']

0     Nitin
1     Shyam
2     Pavan
3    Anjali
4      Ravi
5     Meena
6      Aman
7     Sneha
8       Raj
9     Divya
Name: name, dtype: object

In [35]:
# specific values
friendsRead['name'][2]

'Pavan'

In [ ]:
# specific values update
friendsRead['name'][2] = 'Pavan '